In [213]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
from sklearn.metrics import mean_absolute_error
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
from sklearn.tree import DecisionTreeClassifier
clf = DecisionTreeClassifier()
from collections import Counter, defaultdict
import sys

In [214]:
df = pd.read_csv('titanic.csv')

In [215]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [216]:
df.drop(['PassengerId','Name','Ticket','Cabin','Embarked'],axis=1,inplace = True)

In [217]:
df.tail()

     Survived  Pclass     Sex   Age  SibSp  Parch   Fare
886         0       2    male  27.0      0      0  13.00
887         1       1  female  19.0      0      0  30.00
888         0       3  female   NaN      1      2  23.45
889         1       1    male  26.0      0      0  30.00
890         0       3    male  32.0      0      0   7.75

In [218]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [219]:
round(df.Age.mean(),0)

30.0

In [220]:
for i in range(1,4):
    for s in ['male','female']:
        print('Class - ',i, 'Sex',s,'=',df[(df.Pclass==i) & (df.Sex==s)]['Age'].median())

Class -  1 Sex male = 40.0
Class -  1 Sex female = 35.0
Class -  2 Sex male = 30.0
Class -  2 Sex female = 28.0
Class -  3 Sex male = 25.0
Class -  3 Sex female = 21.5

In [221]:
df.Age.fillna(round(df.Age.mean(),0), inplace = True)

In [222]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
dtypes: float64(2), int64(4), object(1)
memory usage: 48.9+ KB

In [223]:
df.loc[df.Sex=='male','Sex'] = 0
df.loc[df.Sex=='female','Sex'] = 1

In [224]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('Age', axis=1),
                                                   df.Age,
                                                   test_size=0.3,
                                                   random_state = 42
                                                   )

In [225]:
y_train.value_counts(normalize=True)

30.00    0.226324
24.00    0.035313
28.00    0.030498
19.00    0.028892
25.00    0.028892
           ...
80.00    0.001605
70.50    0.001605
12.00    0.001605
45.50    0.001605
0.83     0.001605
Name: Age, Length: 77, dtype: float64

In [226]:
y_test.value_counts(normalize=True)

30.0    0.227612
36.0    0.037313
22.0    0.037313
29.0    0.029851
18.0    0.029851
          ...
41.0    0.003731
14.0    0.003731
13.0    0.003731
58.0    0.003731
36.5    0.003731
Name: Age, Length: 65, dtype: float64

In [227]:
lr.fit(X_train,y_train)

LinearRegression()

In [228]:
pred = lr.predict(X_test)

In [229]:
print('Ошибка на тесте', mean_absolute_error(y_test, pred))

Ошибка на тесте 8.559325682302854

In [230]:
print('Ошибка на обучающей выборке', mean_absolute_error(y_train, lr.predict(X_train)))

Ошибка на обучающей выборке 9.094808202469135

In [231]:
result = X_test

In [239]:
result['real_age'] = y_test
result['predict_age'] = np.round(pred)

In [238]:
result

     Survived  Pclass Sex  SibSp  Parch     Fare  real_age  predict_age
709         1       3   0      1      1  15.2458      30.0         21.0
439         0       2   0      0      0  10.5000      31.0         35.0
840         0       3   0      0      0   7.9250      20.0         29.0
720         1       2   1      0      1  33.0000       6.0         28.0
39          1       3   1      1      0  11.2417      14.0         22.0
..        ...     ...  ..    ...    ...      ...       ...          ...
821         1       3   0      0      0   8.6625      27.0         24.0
633         0       1   0      0      0   0.0000      30.0         41.0
456         0       1   0      0      0  26.5500      65.0         41.0
500         0       3   0      0      0   8.6625      17.0         29.0
430         1       1   0      0      0  26.5500      28.0         36.0

[268 rows x 8 columns]